index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Evan's Git Website</title>
<!-- 2019-10-21 Mon 12:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Evan James McCarter" />
</head>
<body>
<div id="content">
<h1 class="title">Evan's Git Website</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Bitcoin</a>
<ul>
<li><a href="#sec-2-1">2.1. "Bitcoin Plus"</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a website made by Evan McCarter
Send recommendations to <a href="mailto:evan.mccarter@gmail.com">evan.mccarter@gmail.com</a>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Bitcoin</h2>
<div class="outline-text-2" id="text-2">
<p>
If you want to donate, you can send bitcoins to <i>1GPwFQ51uzwx1TuE4rYNo2VFahYvJKjw1c</i>. This keeps the site free of ads and secret bitcoin miners
If you aren't already framiliar with bitcoin, I encourage you to look it up. you can generate bitcoins by running a program on your computer (consuming some electricity and causing hardware wear), but every cycle goes towards protecting the bitcoin network, and making bitcoin useful.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> "Bitcoin Plus"</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is where the "bitcoin plus" stuff would be.
"bitcoin plus" is a potentially secret bitcoin miner, launched using javascript and java. It runs during the user's idle time to generate bitcoins. I removed it because it has been labeled as "insecure", creates security dialogs, leaves an ugly "broken app" box if it can't run, and doesn't even mine bitcoins unless the user goes out of their way to allow it. It's more efficient for you to set up your own system on your own machine rather than have your CPU hijacked by random websites. That's why i put the donation address above =)
If you're interested in the scripts, they're still in the source, just commented out. The farthest I got with reverse-engineering them so they work is that the actual mining applet is located at <a href="http://www.bitcoinplus.com/jar/bitcoinplus-miner.jar">http://www.bitcoinplus.com/jar/bitcoinplus-miner.jar</a> and the script is at <a href="http://www.bitcoinplus.com/js/miner.js">http://www.bitcoinplus.com/js/miner.js</a>
The creator has "obvuscated" the code in the jar: all the variables are letters from a-z, and it's almost inpenetrable unless you rename everything, which I haven't done.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan James McCarter</p>
<p class="date">Created: 2019-10-21 Mon 12:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
